// Identify emails that contain Google Docs links 

EmailUrlInfo 
| where Url startswith "https://docs.google.com/document/" 
| join (EmailEvents 
| where EmailDirection == "Inbound" 

// Uncomment the line below to narrow search down to message IDs that resemble IDs used in known attack
// emails and contain a link a document in Google Docs. These behaviors have been observed leading 
// to ransomware attacks

// | where InternetMessageId matches regex "\\<\\w{ 38,42} \\@") on NetworkMessageId 